# Условные операторы
# if (если) - за начало объявления логики(1 раз определяется)
# elif (ещё если) - можно использовать сколько угодно раз (после if в его табуляции на одном уровне)
# else (иначе) - без условия в конце логики(1 раз испльзуется)



#пользователь подбрасывает монетку и в зависимости от результата происходит вывод данных. Если орёл - победил противник,если решка - победил пользователь,если ребро - ничья
# понадобится input 
token = input("Что выпало?")
if token == "Орёл":
 print("Побеждает противник")
elif token == "решка":
 print("Побеждает игрок")
elif token == "ребро":
 print("Ничья")
else:
 print("Некоректные данные")

 # пользователь вводит 2 числа Если первое число больше второго,то надо это вывести и наоборот: если число меньше,то тоже вывести Если они равны вывести равентсво
 # Проверка на ошибку

number1 = int(input("Введите первое число:"))
number2 = int(input("Введите второе число:"))
if number1 > number2:
    print("Первое число больше второго")
elif number1 < number2:
    print("Первое число меньше второго")
elif number1 == number2:
    print("Числа равны")
else:
    print("Некоректные данные")


    number = 25
    print(type(number))

